analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/spc_regs.h
/**
 * @file    spc_regs.h
 * @brief   Registers, Bit Masks and Bit Positions for the SPC Peripheral Module.
 * @note    This file is @generated.
 * @ingroup spc_registers
 */

/******************************************************************************
 *
 * Copyright (C) 2024 Analog Devices, Inc.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#ifndef LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32657_INCLUDE_SPC_REGS_H_
#define LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32657_INCLUDE_SPC_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

#if defined (__ICCARM__)
  #pragma system_include
#endif

#if defined (__CC_ARM)
  #pragma anon_unions
#endif
/// @cond
/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __R
#define __R  volatile const
#endif
/// @endcond

/* **** Definitions **** */

/**
 * @ingroup     spc
 * @defgroup    spc_registers SPC_Registers
 * @brief       Registers, Bit Masks and Bit Positions for the SPC Peripheral Module.
 * @details     Secure Privilege Controller.
 */

/**
 * @ingroup spc_registers
 * Structure type to access the SPC Registers.
 */
typedef struct {
    __IO uint32_t ctrl;                 /**< <tt>\b 0x0000:</tt> SPC CTRL Register */
    __R  uint32_t rsv_0x4;
    __IO uint32_t resp;                 /**< <tt>\b 0x0008:</tt> SPC RESP Register */
    __R  uint32_t rsv_0xc_0x1f[5];
    __I  uint8_t  mpc_status;           /**< <tt>\b 0x0020:</tt> SPC MPC_STATUS Register */
    __R  uint8_t  rsv_0x21_0x23[3];
    __IO uint32_t mpc_inten;            /**< <tt>\b 0x0024:</tt> SPC MPC_INTEN Register */
    __R  uint32_t rsv_0x28_0x2f[2];
    __I  uint32_t ppc_status;           /**< <tt>\b 0x0030:</tt> SPC PPC_STATUS Register */
    __O  uint32_t ppc_intclr;           /**< <tt>\b 0x0034:</tt> SPC PPC_INTCLR Register */
    __IO uint32_t ppc_inten;            /**< <tt>\b 0x0038:</tt> SPC PPC_INTEN Register */
    __R  uint32_t rsv_0x3c_0x7f[17];
    __IO uint32_t nscidau;              /**< <tt>\b 0x0080:</tt> SPC NSCIDAU Register */
    __R  uint32_t rsv_0x84_0x8f[3];
    __IO uint32_t m33lock;              /**< <tt>\b 0x0090:</tt> SPC M33LOCK Register */
    __R  uint32_t rsv_0x94_0x11f[35];
    __IO uint32_t apbsec;               /**< <tt>\b 0x0120:</tt> SPC APBSEC Register */
    __R  uint32_t rsv_0x124_0x15f[15];
    __IO uint32_t apbpriv;              /**< <tt>\b 0x0160:</tt> SPC APBPRIV Register */
    __R  uint32_t rsv_0x164_0x16f[3];
    __IO uint32_t ahbmpriv;             /**< <tt>\b 0x0170:</tt> SPC AHBMPRIV Register */
    __R  uint32_t rsv_0x174_0x17f[3];
    __IO uint32_t gpio0;                /**< <tt>\b 0x0180:</tt> SPC GPIO0 Register */
} mxc_spc_regs_t;

/* Register offsets for module SPC */
/**
 * @ingroup    spc_registers
 * @defgroup   SPC_Register_Offsets Register Offsets
 * @brief      SPC Peripheral Register Offsets from the SPC Base Peripheral Address.
 * @{
 */
#define MXC_R_SPC_CTRL                     ((uint32_t)0x00000000UL) /**< Offset from SPC Base Address: <tt> 0x0000</tt> */
#define MXC_R_SPC_RESP                     ((uint32_t)0x00000008UL) /**< Offset from SPC Base Address: <tt> 0x0008</tt> */
#define MXC_R_SPC_MPC_STATUS               ((uint32_t)0x00000020UL) /**< Offset from SPC Base Address: <tt> 0x0020</tt> */
#define MXC_R_SPC_MPC_INTEN                ((uint32_t)0x00000024UL) /**< Offset from SPC Base Address: <tt> 0x0024</tt> */
#define MXC_R_SPC_PPC_STATUS               ((uint32_t)0x00000030UL) /**< Offset from SPC Base Address: <tt> 0x0030</tt> */
#define MXC_R_SPC_PPC_INTCLR               ((uint32_t)0x00000034UL) /**< Offset from SPC Base Address: <tt> 0x0034</tt> */
#define MXC_R_SPC_PPC_INTEN                ((uint32_t)0x00000038UL) /**< Offset from SPC Base Address: <tt> 0x0038</tt> */
#define MXC_R_SPC_NSCIDAU                  ((uint32_t)0x00000080UL) /**< Offset from SPC Base Address: <tt> 0x0080</tt> */
#define MXC_R_SPC_M33LOCK                  ((uint32_t)0x00000090UL) /**< Offset from SPC Base Address: <tt> 0x0090</tt> */
#define MXC_R_SPC_APBSEC                   ((uint32_t)0x00000120UL) /**< Offset from SPC Base Address: <tt> 0x0120</tt> */
#define MXC_R_SPC_APBPRIV                  ((uint32_t)0x00000160UL) /**< Offset from SPC Base Address: <tt> 0x0160</tt> */
#define MXC_R_SPC_AHBMPRIV                 ((uint32_t)0x00000170UL) /**< Offset from SPC Base Address: <tt> 0x0170</tt> */
#define MXC_R_SPC_GPIO0                    ((uint32_t)0x00000180UL) /**< Offset from SPC Base Address: <tt> 0x0180</tt> */
/**@} end of group spc_registers */

/**
 * @ingroup  spc_registers
 * @defgroup SPC_CTRL SPC_CTRL
 * @brief    SPC Secure Configuration Control Register.
 * @{
 */
#define MXC_F_SPC_CTRL_LOCK_POS                        0 /**< CTRL_LOCK Position */
#define MXC_F_SPC_CTRL_LOCK                            ((uint32_t)(0x1UL << MXC_F_SPC_CTRL_LOCK_POS)) /**< CTRL_LOCK Mask */

/**@} end of group SPC_CTRL_Register */

/**
 * @ingroup  spc_registers
 * @defgroup SPC_RESP SPC_RESP
 * @brief    Security Violation Response Configuration Register.
 * @{
 */
#define MXC_F_SPC_RESP_VIOLCFG_POS                     0 /**< RESP_VIOLCFG Position */
#define MXC_F_SPC_RESP_VIOLCFG                         ((uint32_t)(0x1UL << MXC_F_SPC_RESP_VIOLCFG_POS)) /**< RESP_VIOLCFG Mask */

/**@} end of group SPC_RESP_Register */

/**
 * @ingroup  spc_registers
 * @defgroup SPC_MPC_STATUS SPC_MPC_STATUS
 * @brief    Secure MPC Status Register.
 * @{
 */
#define MXC_F_SPC_MPC_STATUS_SRAM0_POS                 0 /**< MPC_STATUS_SRAM0 Position */
#define MXC_F_SPC_MPC_STATUS_SRAM0                     ((uint8_t)(0x1UL << MXC_F_SPC_MPC_STATUS_SRAM0_POS)) /**< MPC_STATUS_SRAM0 Mask */

#define MXC_F_SPC_MPC_STATUS_SRAM1_POS                 1 /**< MPC_STATUS_SRAM1 Position */
#define MXC_F_SPC_MPC_STATUS_SRAM1                     ((uint8_t)(0x1UL << MXC_F_SPC_MPC_STATUS_SRAM1_POS)) /**< MPC_STATUS_SRAM1 Mask */

#define MXC_F_SPC_MPC_STATUS_SRAM2_POS                 2 /**< MPC_STATUS_SRAM2 Position */
#define MXC_F_SPC_MPC_STATUS_SRAM2                     ((uint8_t)(0x1UL << MXC_F_SPC_MPC_STATUS_SRAM2_POS)) /**< MPC_STATUS_SRAM2 Mask */

